# a := '110011'
# c := Извлечь(a, 1)
# если с = '1'
# то q := 1
# иначе q := 2
# конец если
# Стереть(а, 1)
# нц пока q < 3
# i := 1
#     нц пока i < Длина(а)
#     i := i + 1
# кц
# если q = 1
# то a := Склеить(a, '1')
#     иначе a := Склеить(a, '0')
# конец если
# q := 3
# кц


a = list("110011")
c = a[1 - 1]
if c == "1":
    q = 1
else:
    q = 2

a.pop(1 - 1)
while q < 3:
    i = 1
    while i < len(a):
        i += 1
    if q == 1:
        a += "1"
    else:
        a += "0"
    q = 3
print(*a, sep="")
